src/Openfoam/AeroSUVDC/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version: dev-cfMesh                             |
|   \  /    A nd           | Web:      https://sourceforge.net/projects/cfmesh|
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshDict;
}

surfaceFile "Geometry/mergedGeometry/mergedGeometry.stl"; // STL surface

// Global cell size controls
maxCellSize     0.3;     // Base size
minCellSize     0.01;    // Smallest size allowed

// Geometry definition
geometry
{
    Geometry
    {
        type triSurfaceMesh;
        file "Geometry/mergedGeometry/mergedGeometry.stl";
    }
}

// Background mesh for external domain
backgroundMesh
{
    box
    {
        type searchableBox;
        min (-5 -5 -5);
        max (5 5 5);
    }
    cellSize 0.1;
}

// Internal refinement regions (translated from refinementBox)
refinementBoxes
{
    refinementBox
    {
        type searchableBox;
        min (-1.3622519969940186 -0.5119140148162842 -0.0059986598789691925);
        max (3.258755922317505 0.5119140148162842 0.596733808517456);
        insideLevel 4;
    }

    refinementBox2
    {
        type searchableBox;
        min (-0.43805038928985596 -0.3583398163318634 -0.0059986598789691925);
        max (1.8146910667419434 0.3583398163318634 0.4761873483657837);
        insideLevel 6;
    }
}

// Surface mesh refinement
meshSettings
{
    nCellsBetweenLevels 5; // analogous to snappy’s nCellsBetweenLevels
    boundaryCellSize 0.02; // approximate surface refinement

    surfaceMeshRefinement
    {
        enable 1;
        levels
        {
            Geometry
            {
                level (3 4);
            }
        }
    }

    internalRefinement
    {
        enable 1;
    }
}

// Boundary layers
boundaryLayers
{
    nLayers                10;
    thicknessRatio         0.3;
    maxFirstLayerThickness 0.05;
    allowDiscontinuity     0;
    featureAngle           60;
}

